
//=============================================================================
// business_logic - класс бизнес-логики приложения
// Автор: Иванченко М.В.
// Дата начала разработки:  13-03-2017
// Дата обновления:         13-03-2017
// Первый релиз:            0.0.0.0
// Текущий релиз:           0.0.0.0
//=============================================================================
using System;

namespace cfmc.quotas
{

    public static class business_logic
    {
        /*
         * --------------------------------------------------------------------
         *                          PROPERTIES
         * --------------------------------------------------------------------
         */
        #region __PROPERTIES__
        #endregion//__PROPERTIES__

        /*
         * --------------------------------------------------------------------
         *                          INITIALIZE
         * --------------------------------------------------------------------
         */
        #region __INITIALIZE__
        /// <summary>
        /// init_data_store - инициализация хранилища данных
        /// </summary>
        public static void init_data_store( )
        {
            //basins
            data_model_store.init_basins( );
            //regimes
            data_model_store.init_regimes( );
            //WBRs
            data_model_store.init_WBRs( );
            //regions
            data_model_store.init_regions( );
        }
        #endregion //__INITIALIZE__

        /*
        * --------------------------------------------------------------------
        *                          METHODS
        * --------------------------------------------------------------------
        */
        #region __METHODS__
        #endregion//__METHODS__

        /*
         * --------------------------------------------------------------------
         *                          EVENTS
         * --------------------------------------------------------------------
         */
        #region __EVENTS__
        #endregion//__EVENTS__

        /*
         * --------------------------------------------------------------------
         *                          FIELDS
         * --------------------------------------------------------------------
         */
        #region __FIELDS__
        #endregion//__FIELDS__

    }//class business_logic

}//namespace cfmc.quotas

            