//=============================================================================
// объявление интерфейсов
// Автор: Иванченко М.В.
// Дата начала разработки:  15-03-2017
// Дата обновления:         23-03-2017
// Первый релиз:            1.0.0.0
// Текущий релиз:           1.0.0.0
//=============================================================================

namespace cfmc.utils
{
    /// <summary>
    /// interface IDataRow
    /// </summary>
    public interface IDataRow
    {
        object[] Fields( );
    }
}
